{
  "iso_27001_2022": {
    "metadata": {
      "title": "ISO/IEC 27001:2022 - Sécurité de l'information",
      "version": "3ème édition",
      "langues": ["fr", "en"],
      "sections_principales": [
        "Contexte de l'organisation", "Leadership", "Planification",
        "Support", "Opération", "Évaluation des performances", "Amélioration"
      ]
    },
    "exigences_cles": [
      {
        "section": "4.1",
        "titre": "Compréhension de l'organisation et de son contexte",
        "description": "Identifier les enjeux internes/externes affectant le SMSI.",
        "conformite_check": [
          "Avez-vous identifié les enjeux internes (ex. culture, processus) affectant votre sécurité ?",
          "Avez-vous listé les enjeux externes (ex. lois, concurrents) ?"
        ],
        "actions_correctives": [
          "Documentez les enjeux internes et externes dans un registre.",
          "Menez une analyse SWOT pour clarifier le contexte."
        ]
      },
      {
        "section": "6.1.2",
        "titre": "Évaluation des risques",
        "description": "Processus d'analyse des risques incluant : actifs, menaces, vulnérabilités, niveau de risque.",
        "conformite_check": [
          "Avez-vous un inventaire des actifs critiques ?",
          "Avez-vous identifié les menaces et vulnérabilités associées ?",
          "Utilisez-vous une méthode pour évaluer les niveaux de risque ?"
        ],
        "actions_correctives": [
          "Créez un inventaire des actifs avec leur propriétaire.",
          "Utilisez une matrice de risques pour évaluer menaces et vulnérabilités.",
          "Formez votre équipe sur les méthodologies d'évaluation des risques."
        ]
      }
    ],
    "controles_annexe_A": {
      "categories": [
        {
          "id": "5",
          "nom": "Contrôles organisationnels",
          "controles": [
            {
              "id": "5.1",
              "titre": "Politiques de sécurité",
              "description": "Élaborer, approuver et communiquer les politiques de sécurité.",
              "exigences": "Les politiques doivent être mises à jour périodiquement et validées par la direction.",
              "bonnes_pratiques": [
                "Identifier les besoins de sécurité.",
                "Élaborer une politique claire et accessible.",
                "Obtenir l'approbation de la direction.",
                "Communiquer et sensibiliser les employés.",
                "Réviser et mettre à jour régulièrement."
              ],
              "exemples": "Exemple : Mise en place d'une politique exigeant l'authentification à deux facteurs.",
              "mots_cles": ["politiques de sécurité", "mise en place", "stratégie de sécurité", "ISO 27001"],
              "conformite_check": [
                "Avez-vous une politique de sécurité écrite ?",
                "Est-elle approuvée par la direction ?",
                "Est-elle communiquée à tous les employés ?",
                "Est-elle mise à jour régulièrement ?"
              ],
              "actions_correctives": [
                "Rédigez une politique de sécurité si elle n'existe pas.",
                "Obtenez l'approbation écrite de la direction.",
                "Organisez une session de sensibilisation pour les employés.",
                "Planifiez une révision annuelle de la politique."
              ]
            },
            {
              "id": "5.7",
              "titre": "Renseignement sur les menaces",
              "description": "Collecter et analyser les informations sur les menaces cybersécurité.",
              "exigences": "Les menaces doivent être surveillées en continu avec des sources fiables.",
              "bonnes_pratiques": [
                "Utiliser des plateformes de threat intelligence.",
                "Analyser les incidents et partager les retours d'expérience.",
                "Mettre en place une veille active sur les nouvelles vulnérabilités."
              ],
              "exemples": "Exemple : Utilisation d'un SOC pour surveiller et détecter les menaces.",
              "mots_cles": ["renseignement sur les menaces", "cybersécurité", "ISO 27001", "veille sécurité"],
              "conformite_check": [
                "Surveillez-vous les menaces en continu ?",
                "Utilisez-vous des sources fiables pour le renseignement sur les menaces ?",
                "Analysez-vous les incidents passés pour en tirer des leçons ?"
              ],
              "actions_correctives": [
                "Abonnez-vous à une plateforme de threat intelligence (ex. Recorded Future).",
                "Mettez en place un processus de veille sur les vulnérabilités.",
                "Documentez et partagez les leçons tirées des incidents."
              ]
            }
          ]
        }
      ]
    },
    "workflow_typique": {
      "phases": [
        {
          "phase": "Évaluation des risques",
          "etapes": [
            "Identifier les actifs critiques",
            "Analyser les impacts potentiels",
            "Cartographier les menaces et vulnérabilités"
          ]
        },
        {
          "phase": "Traitement des risques",
          "etapes": [
            "Sélectionner et implémenter les contrôles",
            "Rédiger et valider la Déclaration d'Applicabilité (SoA)",
            "Auditer les mesures mises en place"
          ]
        }
      ]
    },
    "faq_chatbot": [
      {
          "question": "Quels sont les 4 types de contrôles de l'Annexe A ?",
          "reponse": "Les contrôles organisationnels, liés aux personnes, physiques et technologiques."
      },
      {
          "question": "Quelle est la différence entre ISO 27001 et ISO 27002 ?",
          "reponse": "ISO 27001 définit les exigences obligatoires pour un SMSI, tandis que ISO 27002 fournit des recommandations pour leur mise en œuvre."
      },
      {
          "question": "Comment obtenir la certification ISO 27001 ?",
          "reponse": [
              "Réaliser une évaluation des risques.",
              "Mettre en place les contrôles nécessaires de l'Annexe A.",
              "Effectuer un audit interne.",
              "Passer un audit de certification par un organisme accrédité."
          ]
      },
      {
          "question": "Quels sont les avantages de la certification ISO 27001 ?",
          "reponse": [
              "Une meilleure sécurité des données.",
              "Conformité aux exigences légales et réglementaires.",
              "Un avantage concurrentiel sur le marché.",
              "Renforcement de la confiance des clients et partenaires."
          ]
      },
      {
          "question": "Qu'est-ce qu'un SMSI ?",
          "reponse": "Un Système de Management de la Sécurité de l'Information (SMSI) est une approche systématique pour gérer les informations sensibles, en assurant leur confidentialité, intégrité et disponibilité."
      },
      {
          "question": "Pourquoi l'évaluation des risques est-elle importante dans ISO 27001 ?",
          "reponse": "L'évaluation des risques permet d'identifier les menaces et vulnérabilités, aidant les organisations à prioriser et réduire les risques pour protéger leurs actifs critiques."
      },
      {
          "question": "À quoi sert la Déclaration d'Applicabilité (SoA) ?",
          "reponse": "La SoA documente les contrôles de l'Annexe A applicables à votre organisation et justifie l'exclusion des autres."
      },
      {
          "question": "À quelle fréquence dois-je réviser mon SMSI ?",
          "reponse": "Le SMSI doit être révisé au moins une fois par an ou à chaque changement significatif (nouvelles menaces, évolutions de l'entreprise, etc.)."
      },
      {
          "question": "Quel est le rôle de la direction dans ISO 27001 ?",
          "reponse": "La direction doit montrer son engagement, établir les politiques de sécurité, allouer des ressources et s'assurer que le SMSI est aligné sur les objectifs de l'entreprise."
      },
      {
          "question": "Quelles sont les principales clauses de ISO 27001:2022 ?",
          "reponse": "Les clauses 4 à 10 : Contexte de l'organisation, Leadership, Planification, Support, Opération, Évaluation des performances, Amélioration."
      },
      {
          "question": "Combien de temps faut-il pour obtenir la certification ISO 27001 ?",
          "reponse": "Cela prend généralement entre 6 et 18 mois, selon la taille, la complexité et les mesures de sécurité existantes de l'organisation."
      },
      {
          "question": "Qu'est-ce que l'Annexe A dans ISO 27001 ?",
          "reponse": "L'Annexe A est une liste de 93 contrôles regroupés en 4 catégories (organisationnels, personnes, physiques, technologiques) pour réduire les risques identifiés."
      },
      {
          "question": "Les petites entreprises peuvent-elles mettre en œuvre ISO 27001 ?",
          "reponse": "Oui, ISO 27001 est adaptable et peut être ajusté aux petites entreprises en se concentrant sur les risques et contrôles critiques."
      },
      {
          "question": "Qu'est-ce qu'un plan de traitement des risques ?",
          "reponse": "Un plan qui décrit comment les risques identifiés seront traités (réduire, éviter, transférer ou accepter) avec des contrôles sélectionnés."
      },
      {
          "question": "Quels sont des exemples de contrôles organisationnels ?",
          "reponse": "Exemples : politiques de sécurité (A.5.1), renseignement sur les menaces (A.5.7), gestion des relations avec les fournisseurs (A.5.19)."
      },
      {
          "question": "Comment identifier les actifs dans ISO 27001 ?",
          "reponse": "Listez tous les actifs d'information (données, matériel, logiciels, personnes) essentiels aux opérations et à la sécurité de votre entreprise."
      },
      {
          "question": "Quelle est la différence entre une menace et une vulnérabilité ?",
          "reponse": "Une menace est un événement potentiel qui peut nuire à un actif, tandis qu'une vulnérabilité est une faiblesse qu'une menace peut exploiter."
      },
      {
          "question": "Que signifie 'contexte de l'organisation' ?",
          "reponse": "Cela désigne la compréhension des facteurs internes et externes (culture, réglementations, parties prenantes) qui affectent le SMSI."
      },
      {
          "question": "Comment réaliser un audit interne pour ISO 27001 ?",
          "reponse": [
              "Définir le périmètre et les critères de l'audit.",
              "Examiner la documentation et les contrôles.",
              "Interroger le personnel et collecter des preuves.",
              "Rapporter les résultats et les non-conformités."
          ]
      },
      {
          "question": "Qu'est-ce que l'authentification à plusieurs facteurs (MFA) ?",
          "reponse": "L'MFA exige au moins deux méthodes de vérification (ex. mot de passe + code) pour renforcer la sécurité des accès (A.8.5)."
      },
      {
          "question": "Pourquoi la formation des employés est-elle importante pour ISO 27001 ?",
          "reponse": "La formation garantit que les employés comprennent les politiques de sécurité, reconnaissent les menaces et respectent les contrôles, réduisant les erreurs humaines."
      },
      {
          "question": "Qu'est-ce qu'un incident de sécurité selon ISO 27001 ?",
          "reponse": "Tout événement compromettant la confidentialité, l'intégrité ou la disponibilité des informations (ex. violation de données, malware)."
      },
      {
          "question": "Comment gérer un incident de sécurité ?",
          "reponse": [
              "Détecter et signaler l'incident.",
              "Contenir et évaluer l'impact.",
              "Atténuer et résoudre le problème.",
              "Documenter les leçons apprises."
          ]
      },
      {
          "question": "Quel est le coût de la certification ISO 27001 ?",
          "reponse": "Les coûts varient (5 000 à 50 000 €+) selon la taille de l'organisation, les frais de consultants et les charges de l'organisme de certification."
      },
      {
          "question": "Que se passe-t-il si j'échoue à l'audit de certification ?",
          "reponse": "Vous recevrez un rapport sur les non-conformités à corriger, puis planifierez un audit de suivi pour vérifier les corrections."
      },
      {
          "question": "Comment ISO 27001 renforce-t-elle la confiance des clients ?",
          "reponse": "La certification montre des pratiques de sécurité robustes, rassurant les clients sur la protection de leurs données."
      },
      {
          "question": "Quel est le rôle de la cryptographie dans ISO 27001 ?",
          "reponse": "La cryptographie (A.8.24) protège la confidentialité et l'intégrité des données grâce au chiffrement et à une gestion sécurisée des clés."
      },
      {
          "question": "ISO 27001 aide-t-elle à respecter le RGPD ?",
          "reponse": "Oui, elle s'aligne avec le RGPD en assurant la protection des données via la gestion des risques et les contrôles de sécurité."
      },
      {
          "question": "Quels sont les contrôles physiques de l'Annexe A ?",
          "reponse": "Contrôles comme les zones sécurisées (A.7.1), la protection des équipements (A.7.4) et les restrictions d'accès physique (A.7.2)."
      },
      {
          "question": "Comment maintenir la certification ISO 27001 ?",
          "reponse": [
              "Réaliser des audits internes réguliers.",
              "Réviser et mettre à jour le SMSI.",
              "Traiter les nouveaux risques et incidents.",
              "Passer les audits de surveillance annuels."
          ]
      },
      {
          "question": "Qu'est-ce que le renseignement sur les menaces dans ISO 27001 ?",
          "reponse": "Collecter et analyser des données sur les menaces en cybersécurité pour protéger proactivement l'organisation (A.5.7)."
      },
      {
          "question": "Quels outils puis-je utiliser pour la conformité ISO 27001 ?",
          "reponse": "Des outils comme les logiciels de gestion des risques (ex. RiskWatch), les systèmes SIEM (ex. Splunk) et les plateformes GRC (ex. LogicGate)."
      },
      {
          "question": "Comment prioriser les risques dans ISO 27001 ?",
          "reponse": "Évaluez les risques selon leur probabilité et leur impact potentiel, puis concentrez-vous sur ceux ayant la plus grande gravité."
      }
  ]
  }
}